## Conventional Import

In [1]:
import pandas as pd
import os
print pd.__version__

0.20.3

# Reading tabular data (Vid-2)

* csv
* excel
* etc

### Experiment 1

In [2]:
DATA_DIR = '../data'

# reading table
# making seperator as comma
# renaming column names for 0th row of the file
df = pd.read_table(
                   os.path.abspath(os.path.join(DATA_DIR,'day1/iris.csv')), 
                   sep=',',
                   header=0,
                   names=['sepal_len', 'sepal_wid', 'petal_len', 'petal_wid', 'class']
                  )

In [3]:
# print top 5 records only
df.head(5)

   sepal_len  sepal_wid  petal_len  petal_wid        class
0        5.1        3.5        1.4        0.2  Iris-setosa
1        4.9        3.0        1.4        0.2  Iris-setosa
2        4.7        3.2        1.3        0.2  Iris-setosa
3        4.6        3.1        1.5        0.2  Iris-setosa
4        5.0        3.6        1.4        0.2  Iris-setosa

### Experiment 2

In [4]:
# data is seperated by '|' so our sep paramater is also '|'
# header=None avoids data first row to be header incase of header not present in the data
# create column names
df = pd.read_table(
                    'http://bit.ly./movieusers', 
                    sep='|', 
                    header=None, 
                    names=['user_id', 'age', 'gender','occupation','zip']
                    )
df.head(5)

   user_id  age gender  occupation    zip
0        1   24      M  technician  85711
1        2   53      F       other  94043
2        3   23      M      writer  32067
3        4   24      M  technician  43537
4        5   33      F       other  15213

# Takeaways

### By default:
1. __read_table__ - takes sep='\t'
2. __read_table__ - assumes 1st row is header row

### Useful
1. __skiprows__ - skip 'x' rows from the top
2. __skipfooter__ - skip 'x' rows from the bottom

# --------------------------------

# Selecting Pandas Series from DataFrame (Vid-3)

* Series is basically column in a dataframe

In [5]:
df = pd.read_table('http://bit.ly/uforeports', sep=',')
df.head(5)

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [6]:
# Case sensitive - Keep in mind

# Bracket notation
print df['State'].head(5)
print type(df['State'])

print 

# Alternative ['.' notation]
print df.State.head(5)
print type(df.State)

0    NY
1    NJ
2    CO
3    KS
4    NY
Name: State, dtype: object
<class 'pandas.core.series.Series'>

0    NY
1    NJ
2    CO
3    KS
4    NY
Name: State, dtype: object
<class 'pandas.core.series.Series'>

### Experiment 1

In [7]:
# creating new series in a dataframe
df['Location'] = df['City'] + ', ' + df['State']
df.head(5)

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

### Experiment 2

In [8]:
# creating new series in a dataframe
# map is used to apply a function to each row of the series in a dataframe
# row is the variable representing each row instance which is then splitted by 'space' and '0th' element is picked as date
date = df['Time'].map(lambda row: row.split()[0])
df['Date'] = date
df.head(5)

,City,Colors Reported,Shape Reported,State,Time,Location,Date
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY",6/1/1930
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ",6/30/1930
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO",2/15/1931
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS",6/1/1931
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY",4/18/1933

# Takeaways

1. If space in the column name then '.' notation does not work. Use bracket notation
2. Column names that are already builtin methods of pandas, '.' notation will not work.
2. Use bracket notation bydefualt.

# --------------------------------

# Some Pandas command end with paranthesis others don't (Vid-4)

In [9]:
# read_csv is alternate to read_table if sep=','
df = pd.read_csv('http://bit.ly/imdbratings')
df.head(5)

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [10]:
# describe() method shows the statistics of all numeric column in a dataframe
df.describe()

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000

In [11]:
# dtypes is a attribute not a method, that's why no ()
df.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

In [12]:
# shape is a attribute not a method, that's why no ()
df.shape

(979, 6)

# Takeaways

1. read_csv is alternate to read_table if sep=','
2. methods are action oriented.
3. attributes are properties.
4. (shift+tab)[4 times] inside method parenthesis to see documentation

# --------------------------------

# Rename Columns in Pandas Dataframe (Vid-5)

In [13]:
df.head(5)

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [14]:
# column names
df.columns

Index([u'star_rating', u'title', u'content_rating', u'genre', u'duration',
       u'actors_list'],
      dtype='object')

### Experiment 1

In [15]:
df = df.rename(columns={'star_rating':'rating', 'title':'movie_name'})
df.head(5)

,rating,movie_name,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

### Experiment 2

In [19]:
# shown in Vid-2 (above)

### Experiment 3

In [22]:
# TIP: Always replace ' ' with a undescore for easy reading
# we will see how to replace '_' with space for this exp.
df.columns = df.columns.str.replace('_',' ')
df.head(5)

,rating,movie name,content rating,genre,duration,actors list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

# Takeaways

1. Always convert spaces in column names to underscore for better reading ability.